
## :x: Apply Failed (dev)

[CI link](https://github.com/Fumi-Mura/infra_portfolio/actions/runs/14380030281)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
module.oidc_iam_policy.data.aws_iam_policy_document.this: Reading...
module.oidc_provider.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::598981015011:oidc-provider/token.actions.githubusercontent.com]
module.oidc_iam_policy.data.aws_iam_policy_document.this: Read complete after 0s [id=1789900679]
module.oidc_iam_policy.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::598981015011:policy/dev-fumis-pf-oidc-iam-policy]
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Reading...
module.oidc_iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3941730555]
module.oidc_iam_role.aws_iam_role.this: Refreshing state... [id=dev-fumis-pf-oidc-iam-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test_s3.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "test-s3-bucket"
        }
      + tags_all                    = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "test-s3-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.test_s3.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "test-s3-bucket"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_s3.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.test_s3.aws_s3_bucket.this: Creating...
╷
│ Error: creating S3 Bucket (test-s3-bucket): operation error S3: CreateBucket, https response error StatusCode: 409, RequestID: M9JGTQQ7JR6RHD54, HostID: 0fhrQxwCC4BIKZxBeglbGFQ0WBHXUTtHj/YOn7lFwtL8bGVUK/d0mLfLUdDNZwjMnfyQK6VjrfA=, BucketAlreadyExists: 
│ 
│   with module.test_s3.aws_s3_bucket.this,
│   on ../../modules/s3/bucket/main.tf line 1, in resource "aws_s3_bucket" "this":
│    1: resource "aws_s3_bucket" "this" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":21,"Program":"tfcmt","SHA1":"632d161e51cbfb4b352d5bc411b03fee75c23c75","Target":"dev","Vars":{},"WorkflowName":"Apply"} -->